#include<bits/stdc++.h>
using namespace std;
using pii = pair<int,int>;
string name[9] = {"z","ข่วงเปา","ดอยแก้ว","บ้านแปะ","บ้านหลวง","แม่สอย","ปิงโค้ง","สบเตี๊ยะ","เชียงดาว"};
vector<pii> v[9] = {{},
                    {{5,2},{37,3},{10,4},{4,5},{15,6},{26,7},{30,8}},
                    {{5,1},{13,3},{29,4},{29,5},{6,6},{25,7},{17,8}},
                    {{37,1},{13,2},{26,4},{22,5},{30,6},{2,7},{18,8}},
                    {{10,1},{29,2},{26,3},{18,5},{27,6},{30,7},{36,8}},
                    {{4,1},{29,2},{22,3},{18,4},{29,6},{17,7},{20,8}},
                    {{15,1},{6,2},{30,3},{27,4},{29,5},{33,7},{20,8}},
                    {{26,1},{25,2},{2,3},{30,4},{17,5},{33,6},{23,8}},
                    {{30,1},{17,2},{18,3},{36,4},{20,5},{20,6},{23,7}}
                    };
bool vst[9];

int main()
{
    priority_queue<pii> pq;
    pq.push({0,1});
    while(!pq.empty())
    {
        int F = -pq.top().first;
        int S = pq.top().second;
        pq.pop();
        if(vst[S]) continue;
        vst[S] = true;
        if(S!=1) cout << "to " << name[S] << " = " << F << " km.\n";
        for(auto it : v[S])
        {
            if(!vst[it.second]) pq.push({-(it.first+F),it.second});
        }
    }
}
